# Ejemplo de ejecución de integración

In [1]:
import pandas as pd

from CentrosComerciales.grupo2 import grupo2
from CentrosComerciales.grupo3 import Grupo3

C:\Users\71743728\AppData\Local\Temp\ipykernel_13336\1872848033.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
def read_csv(file:str):
    dataframe = pd.read_csv(file, encoding='latin-1', sep=';', dtype={'Visitas': float, 'ProvinciaId': str, 'CentroId': str, 'DivisionId': str, 'DepartamentoId': str})
    return dataframe

In [3]:
grupo2 = grupo2()

# En esta linea  cambiamos el dataframe de ventas y visitas porque el codigo que generaba el equipo 2 era sobre departamentos, centros, etc
# Cuando hayan arreglado el problema estas dos lineas no harian falta
grupo2.ventas = read_csv("datainput/ventas.csv")
grupo2.visitas= read_csv("datainput/visitas.csv")

In [4]:
# Crear instancia de la clase
grupo3_ventas = Grupo3(grupo2.ventas)
grupo3_visitas = Grupo3(grupo2.visitas)

In [5]:
# Ejemplo de consulta 13 a nivel año, trimestre, mes
grupo3_ventas.groupby(division='1', departamento='1', year = 2022, quarter=1, month=3)

  DivisionId DepartamentoId   A¤o  Trimestre  Mes     Visitas
0          1              1  2022          1     3  6690000.0

In [6]:
# Ejemplo de consulta 13 a nivel año, trimestre
grupo3_ventas.groupby(division='1', departamento='1', year = 2022, quarter=1)

  DivisionId DepartamentoId   A¤o  Trimestre     Visitas
0          1              1  2022          1  19980000.0

In [7]:
# Ejemplo de consulta 13 a nivel año
grupo3_ventas.groupby(division='1', departamento='1', year = 2022)

  DivisionId DepartamentoId   A¤o      Visitas
0          1              1  2022  259740000.0

In [8]:
# Ejemplo de consulta 14 a nivel año, trimestre, mes
grupo3_ventas.groupby(division='1', year = 2022, quarter=1, month=3)

  DivisionId   A¤o  Trimestre  Mes      Visitas
0          1  2022          1     3  20070000.0

In [9]:
# Ejemplo de consulta 14 a nivel año, trimestre
grupo3_ventas.groupby(division='1', year = 2022, quarter=1)

  DivisionId   A¤o  Trimestre     Visitas
0          1  2022          1  59940000.0

In [10]:
# Ejemplo de consulta 14 a nivel año
grupo3_ventas.groupby(division='1', year = 2022)

  DivisionId   A¤o      Visitas
0          1  2022  779220000.0

In [11]:
# Ejemplo de consulta 14 a nivel total
grupo3_ventas.groupby(division='1')

  DivisionId       Visitas
0          1  1.637010e+09